#### Plan Output:
<details>

```bash

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.accounts-event.aws_cloudwatch_event_rule.scheduled_event["accounts"] will be created
  + resource "aws_cloudwatch_event_rule" "scheduled_event" {
      + arn                 = (known after apply)
      + description         = "Triggers domain-protect lambda functions according to schedule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "domain-protect-accounts-default"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags_all            = (known after apply)
    }

  # module.accounts-event.aws_cloudwatch_event_target.scheduled_event["accounts"] will be created
  + resource "aws_cloudwatch_event_target" "scheduled_event" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "domain-protect-accounts-default"
      + target_id      = "lambda"
    }

  # module.accounts-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["accounts"] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_invoke_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "domain-protect-accounts-default"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.accounts-role.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "domain-protect-accounts-default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.accounts-role.aws_iam_role_policy.lambda will be created
  + resource "aws_iam_role_policy" "lambda" {
      + id     = (known after apply)
      + name   = "domain-protect-accounts-default"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.cloudwatch-event.aws_cloudwatch_event_rule.scheduled_event["current"] will be created
  + resource "aws_cloudwatch_event_rule" "scheduled_event" {
      + arn                 = (known after apply)
      + description         = "Triggers domain-protect lambda functions according to schedule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "domain-protect-current-default"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags_all            = (known after apply)
    }

  # module.cloudwatch-event.aws_cloudwatch_event_rule.scheduled_event["update"] will be created
  + resource "aws_cloudwatch_event_rule" "scheduled_event" {
      + arn                 = (known after apply)
      + description         = "Triggers domain-protect lambda functions according to schedule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "domain-protect-update-default"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags_all            = (known after apply)
    }

  # module.cloudwatch-event.aws_cloudwatch_event_target.scheduled_event["current"] will be created
  + resource "aws_cloudwatch_event_target" "scheduled_event" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "domain-protect-current-default"
      + target_id      = "lambda"
    }

  # module.cloudwatch-event.aws_cloudwatch_event_target.scheduled_event["update"] will be created
  + resource "aws_cloudwatch_event_target" "scheduled_event" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "domain-protect-update-default"
      + target_id      = "lambda"
    }

  # module.cloudwatch-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["current"] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_invoke_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "domain-protect-current-default"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.cloudwatch-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["update"] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_invoke_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "domain-protect-update-default"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.dynamodb.aws_dynamodb_table.vulnerable_domains will be created
  + resource "aws_dynamodb_table" "vulnerable_domains" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Domain"
      + id               = (known after apply)
      + name             = "DomainProtectVulnerableDomainsDefault"
      + range_key        = "FoundDateTime"
      + read_capacity    = 3
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "domain-protect-vulnerable-domains-default"
        }
      + tags_all         = {
          + "Name" = "domain-protect-vulnerable-domains-default"
        }
      + write_capacity   = 2

      + attribute {
          + name = "Domain"
          + type = "S"
        }
      + attribute {
          + name = "FoundDateTime"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # module.kms.aws_kms_alias.encryption will be created
  + resource "aws_kms_alias" "encryption" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/domain-protect-default"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.kms.aws_kms_key.encryption will be created
  + resource "aws_kms_key" "encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Encryption of domain-protect-default resources"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-default"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::650869176880:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:eu-central-1:650869176880:log-group:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.eu-central-1.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.lambda.data.archive_file.lambda_zip["current"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "terraform-modules/lambda/build/current.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "terraform-modules/lambda/build/lambda_dist_pkg_current"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.lambda_zip["update"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "terraform-modules/lambda/build/update.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "terraform-modules/lambda/build/lambda_dist_pkg_update"
      + type                = "zip"
    }

  # module.lambda.aws_lambda_alias.lambda["current"] will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + description      = "Alias for domain-protect-currents-default"
      + function_name    = "domain-protect-current-default"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "domain-protect-current-default"
    }

  # module.lambda.aws_lambda_alias.lambda["update"] will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + description      = "Alias for domain-protect-updates-default"
      + function_name    = "domain-protect-update-default"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "domain-protect-update-default"
    }

  # module.lambda.aws_lambda_function.lambda["current"] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "domain-protect current Lambda function"
      + filename                       = "terraform-modules/lambda/build/current.zip"
      + function_name                  = "domain-protect-current-default"
      + handler                        = "current.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.aws_lambda_function.lambda["update"] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "domain-protect update Lambda function"
      + filename                       = "terraform-modules/lambda/build/update.zip"
      + function_name                  = "domain-protect-update-default"
      + handler                        = "update.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.lambda-accounts.data.archive_file.lambda_zip["accounts"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "terraform-modules/lambda-accounts/build/accounts.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "terraform-modules/lambda-accounts/build/lambda_dist_pkg_accounts"
      + type                = "zip"
    }

  # module.lambda-accounts.aws_lambda_alias.lambda["accounts"] will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + description      = "Alias for domain-protect-accountss-default"
      + function_name    = "domain-protect-accounts-default"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "domain-protect-accounts-default"
    }

  # module.lambda-accounts.aws_lambda_function.lambda["accounts"] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "domain-protect accounts Lambda function"
      + filename                       = "terraform-modules/lambda-accounts/build/accounts.zip"
      + function_name                  = "domain-protect-accounts-default"
      + handler                        = "accounts.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda-accounts.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.lambda-role.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "domain-protect-lambda-default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda-role.aws_iam_role_policy.lambda will be created
  + resource "aws_iam_role_policy" "lambda" {
      + id     = (known after apply)
      + name   = "domain-protect-lambda-default"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.lambda-scan.data.archive_file.lambda_zip["scan"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "terraform-modules/lambda-scan/build/scan.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "terraform-modules/lambda-scan/build/lambda_dist_pkg_scan"
      + type                = "zip"
    }

  # module.lambda-scan.aws_lambda_alias.lambda["scan"] will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + description      = "Alias for domain-protect-scans-default"
      + function_name    = "domain-protect-scan-default"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "domain-protect-scan-default"
    }

  # module.lambda-scan.aws_lambda_function.lambda["scan"] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "domain-protect scan Lambda function"
      + filename                       = "terraform-modules/lambda-scan/build/scan.zip"
      + function_name                  = "domain-protect-scan-default"
      + handler                        = "scan.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda-scan.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.lambda-slack.data.archive_file.lambda_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "terraform-modules/lambda-slack/build/notify.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "terraform-modules/lambda-slack/build/lambda_dist_pkg_notify"
      + type                = "zip"
    }

  # module.lambda-slack.aws_lambda_alias.lambda[0] will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + description      = "Alias for domain-protect-monitoring_poc-default"
      + function_name    = "domain-protect-slack-monitoring_poc-default"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "domain-protect-slack-monitoring_poc-default"
    }

  # module.lambda-slack.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "domain-protect Lambda function posting to monitoring_poc Slack channel"
      + filename                       = "terraform-modules/lambda-slack/build/notify.zip"
      + function_name                  = "domain-protect-slack-monitoring_poc-default"
      + handler                        = "notify.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "PROJECT"           = "domain-protect"
              + "SLACK_CHANNEL"     = "monitoring_poc"
              + "SLACK_EMOJI"       = ":warning:"
              + "SLACK_FIX_EMOJI"   = ":white_check_mark:"
              + "SLACK_NEW_EMOJI"   = ":octagonal_sign:"
              + "SLACK_USERNAME"    = "Domain Protect"
              + "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda-slack.aws_lambda_permission.sns[0] will be created
  + resource "aws_lambda_permission" "sns" {
      + action        = "lambda:InvokeFunction"
      + function_name = "domain-protect-slack-monitoring_poc-default"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS"
    }

  # module.lambda-slack.aws_sns_topic_subscription.lambda_subscription[0] will be created
  + resource "aws_sns_topic_subscription" "lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.lambda-slack.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.sns.aws_sns_topic.sns_topic will be created
  + resource "aws_sns_topic" "sns_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Domain Protect Default"
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "domain-protect-default"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = jsonencode(
            {
              + Id        = "allow_account_access_to_topic_policy"
              + Statement = [
                  + {
                      + Action    = [
                          + "sns:GetTopicAttributes",
                          + "sns:SetTopicAttributes",
                          + "sns:AddPermission",
                          + "sns:RemovePermission",
                          + "sns:DeleteTopic",
                          + "sns:Subscribe",
                          + "sns:ListSubscriptionsByTopic",
                          + "sns:Publish",
                          + "sns:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "650869176880"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-central-1:650869176880:domain-protect-default"
                      + Sid       = "allow_account_access_to_topic"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                    = (known after apply)
    }

  # module.sns-dead-letter-queue.aws_sns_topic.sns_topic will be created
  + resource "aws_sns_topic" "sns_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Domain Protect Dead Letter Queue Default"
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "domain-protect-dlq-default"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = jsonencode(
            {
              + Id        = "allow_account_access_to_topic_policy"
              + Statement = [
                  + {
                      + Action    = [
                          + "sns:GetTopicAttributes",
                          + "sns:SetTopicAttributes",
                          + "sns:AddPermission",
                          + "sns:RemovePermission",
                          + "sns:DeleteTopic",
                          + "sns:Subscribe",
                          + "sns:ListSubscriptionsByTopic",
                          + "sns:Publish",
                          + "sns:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "650869176880"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dlq-default"
                      + Sid       = "allow_account_access_to_topic"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                    = (known after apply)
    }

  # module.step-function.aws_cloudwatch_log_group.log_group_for_sfn will be created
  + resource "aws_cloudwatch_log_group" "log_group_for_sfn" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "/aws/vendedlogs/states/domain-protect-scan-default"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # module.step-function.aws_sfn_state_machine.state_machine will be created
  + resource "aws_sfn_state_machine" "state_machine" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "domain-protect-scan-default"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags_all      = (known after apply)
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

  # module.step-function-role.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "domain-protect-state-default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.step-function-role.aws_iam_role_policy.lambda will be created
  + resource "aws_iam_role_policy" "lambda" {
      + id     = (known after apply)
      + name   = "domain-protect-state-default"
      + policy = (known after apply)
      + role   = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
